---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySunIntensityValue
source: html/04dbce7d-53be-8d3e-ece8-d91f465646dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySunIntensityValue Property

"Sun intensity"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudySunIntensityValue { get; }
```